---
type: ViewsExportingByContextEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# ViewsExportingByContextEventArgs

`Autodesk.Revit.DB.Events.ViewsExportingByContextEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetViewIds | 2021 | `public IList < ElementId > GetViewIds ()` |